In [1]:
import pandas as pd
import numpy as np

In [2]:
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
users = pd.read_csv('dataset/movielens/u.user', sep='|', encoding='latin-1', names=u_cols)

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('dataset/movielens/u.data', sep='\t', encoding='latin-1', names=r_cols)

# the movies file contains columns indicating the genre of the movie
# loading only the first five columns
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv('dataset/movielens/u.item', sep='|', encoding='latin-1', usecols=range(5), names=m_cols)

In [3]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 5 columns):
movie_id              1682 non-null int64
title                 1682 non-null object
release_date          1681 non-null object
video_release_date    0 non-null float64
imdb_url              1679 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 65.8+ KB

In [4]:
print movies.head(10)

   movie_id                                              title release_date  \
0         1                                   Toy Story (1995)  01-Jan-1995
1         2                                   GoldenEye (1995)  01-Jan-1995
2         3                                  Four Rooms (1995)  01-Jan-1995
3         4                                  Get Shorty (1995)  01-Jan-1995
4         5                                     Copycat (1995)  01-Jan-1995
5         6  Shanghai Triad (Yao a yao yao dao waipo qiao) ...  01-Jan-1995
6         7                              Twelve Monkeys (1995)  01-Jan-1995
7         8                                        Babe (1995)  01-Jan-1995
8         9                            Dead Man Walking (1995)  01-Jan-1995
9        10                                 Richard III (1995)  22-Jan-1996

   video_release_date                                           imdb_url
0                 NaN  http://us.imdb.com/M/title-exact?Toy%20Story%2...
1                 NaN  http://us.imdb.com/M/title-exact?GoldenEye%20(...
2                 NaN  http://us.imdb.com/M/title-exact?Four%20Rooms%...
3                 NaN  http://us.imdb.com/M/title-exact?Get%20Shorty%...
4                 NaN  http://us.imdb.com/M/title-exact?Copycat%20(1995)
5                 NaN  http://us.imdb.com/Title?Yao+a+yao+yao+dao+wai...
6                 NaN  http://us.imdb.com/M/title-exact?Twelve%20Monk...
7                 NaN     http://us.imdb.com/M/title-exact?Babe%20(1995)
8                 NaN  http://us.imdb.com/M/title-exact?Dead%20Man%20...
9                 NaN  http://us.imdb.com/M/title-exact?Richard%20III...

In [5]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [6]:
movies[20:22]

,movie_id,title,release_date,video_release_date,imdb_url
20,21,Muppet Treasure Island (1996),16-Feb-1996,NaN,http://us.imdb.com/M/title-exact?Muppet%20Trea...
21,22,Braveheart (1995),16-Feb-1996,NaN,http://us.imdb.com/M/title-exact?Braveheart%20...

In [7]:
# selecting
users['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

In [8]:
users[['age', 'zip_code']].head()

   age zip_code
0   24    85711
1   53    94043
2   23    32067
3   24    43537
4   33    15213

In [9]:
# users older than 25
print users[users.age > 25].head(3)
print '\n'
# users aged 40 and male
print users[(users.age == 40) & (users.sex == 'M')].head(3)
print '\n'
# users younger than 30 or female
print users[(users.age < 30) | (users.sex == 'F')].head(3)

   user_id  age sex occupation zip_code
1        2   53   F      other    94043
4        5   33   F      other    15213
5        6   42   M  executive    98101


     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232


   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067

In [10]:
# set user_id as index
print users.set_index('user_id').head()
print '\n'

# this won't change the users DataFrame. It creates a copy instead
print users.head()
with_new_index = users.set_index('user_id')
with_new_index.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213


   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

In [11]:
# or use the inplace parameter
users.set_index('user_id', inplace=True)
users.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

In [12]:
# select rows by position using iloc
print users.iloc[99]
print "\n"
print users.iloc[[1, 50, 300]]

age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object


         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

In [13]:
# select rows by label using loc
print users.loc[100]
print "\n"
print users.loc[[2, 51, 301]]

age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object


         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

In [14]:
# restore pandas default index using reset_index
users.reset_index(inplace=True)
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [15]:
# joining dataframes using merge
# similar to sql join operation
# if key columns are named different use left_on and right_on parameters
left_frame = pd.DataFrame({'key': range(5),
                           'left_value': ['a', 'b', 'c', 'd', 'e']})
right_frame = pd.DataFrame({'key': range(2, 7),
                           'right_value': ['f', 'g', 'h', 'i', 'j']})

print left_frame
print "\n"
print right_frame

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e


   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

In [16]:
# inner join
pd.merge(left_frame, right_frame, on='key', how='inner')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h

In [17]:
# left outer join
pd.merge(left_frame, right_frame, on='key', how='left')

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h

In [18]:
# right outer join
pd.merge(left_frame, right_frame, on='key', how='right')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h
3    5        NaN           i
4    6        NaN           j

In [19]:
# full outer join
pd.merge(left_frame, right_frame, on='key', how='outer')

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h
5    5        NaN           i
6    6        NaN           j

In [20]:
# combining DataFrames using concat
# takes a list of Series or DataFrames as input
# similar to sql union
pd.concat([left_frame, right_frame])

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
0    2        NaN           f
1    3        NaN           g
2    4        NaN           h
3    5        NaN           i
4    6        NaN           j

In [21]:
# by default the objects are appended vertically
# for side-by-side concatenation use the axis parameter
pd.concat([left_frame, right_frame], axis=1)

   key left_value  key right_value
0    0          a    2           f
1    1          b    3           g
2    2          c    4           h
3    3          d    5           i
4    4          e    6           j

In [22]:
# grouping
headers = ['name','title', 'department', 'salary']
chicago = pd.read_csv('dataset/city-of-chicago-salaries.csv',
                      names=headers,
                      header=0,
                      converters={'salary': lambda x: float(x.replace('$', ''))})
chicago.head()

                    name                     title        department   salary
0        AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT  85512.0
1      AARON,  JEFFERY M            POLICE OFFICER            POLICE  75372.0
2    AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES  80916.0
3    ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  99648.0
4  ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC          AVIATION  89440.0

In [23]:
by_dept = chicago.groupby('department')
by_dept

In [24]:
print by_dept.count().head() # NOT NULL records within each column
print "\n"
print by_dept.size().head() # total records for each department

                   name  title  salary
department
ADMIN HEARNG         42     42      42
ANIMAL CONTRL        61     61      61
AVIATION           1218   1218    1218
BOARD OF ELECTION   110    110     110
BOARD OF ETHICS       9      9       9


department
ADMIN HEARNG           42
ANIMAL CONTRL          61
AVIATION             1218
BOARD OF ELECTION     110
BOARD OF ETHICS         9
dtype: int64

In [25]:
print by_dept.sum().head()
print "\n"
print by_dept.mean().head()
print "\n"
print by_dept.median().head()

                        salary
department
ADMIN HEARNG        2954148.00
ANIMAL CONTRL       3484408.80
AVIATION           86037387.44
BOARD OF ELECTION   6130176.00
BOARD OF ETHICS      734856.00


                         salary
department
ADMIN HEARNG       70336.857143
ANIMAL CONTRL      57121.455738
AVIATION           70638.249130
BOARD OF ELECTION  55728.872727
BOARD OF ETHICS    81650.666667


                    salary
department
ADMIN HEARNG       63456.0
ANIMAL CONTRL      55212.0
AVIATION           70408.0
BOARD OF ELECTION  49236.0
BOARD OF ETHICS    75240.0

In [26]:
# 5 departments with most unique title
by_dept.title.nunique().sort_values(ascending=False)[:5]

department
WATER MGMNT    153
TRANSPORTN     150
POLICE         130
AVIATION       125
HEALTH         118
Name: title, dtype: int64

In [27]:
# split apply combine

# The real power of groupby comes from it's split-apply-combine ability.

# What if we wanted to see the highest paid employee within each department. Given our current dataset, we'd have to do something like this in SQL:

# SELECT *
# FROM chicago c
# INNER JOIN (
#     SELECT department, max(salary) max_salary
#     FROM chicago
#     GROUP BY department
# ) m
# ON c.department = m.department
# AND c.salary = m.max_salary;

# This would give you the highest paid person in each department, but it would return multiple if there were many equally high paid people within a department.

# Alternatively, you could alter the table, add a column, and then write an update statement to populate that column. However, that's not always an option.

# Using groupby we can define a function (which we'll call ranker) that will label each record from 1 to N, where N is the number of employees within the department.

# We can then call apply to, well, apply that function to each group (in this case, each department).

def ranker(df):
    """Assigns a rank to each employee based on salary, with 1 being the highest paid.
    Assumes the data is DESC sorted."""
    df['dept_rank'] = np.arange(len(df)) + 1
    return df

In [28]:
chicago.sort_values('salary', ascending=False, inplace=True)
chicago = chicago.groupby('department').apply(ranker)
print chicago[chicago.dept_rank == 1].head()

                         name                     title      department  \
18039     MC CARTHY,  GARRY F  SUPERINTENDENT OF POLICE          POLICE
8004           EMANUEL,  RAHM                     MAYOR  MAYOR'S OFFICE
25588       SANTIAGO,  JOSE A         FIRE COMMISSIONER            FIRE
763    ANDOLINO,  ROSEMARIE S  COMMISSIONER OF AVIATION        AVIATION
4697     CHOUCAIR,  BECHARA N    COMMISSIONER OF HEALTH          HEALTH

         salary  dept_rank
18039  260004.0          1
8004   216210.0          1
25588  202728.0          1
763    186576.0          1
4697   177156.0          1